Revit 2026 API

# HardwoodApplicationType Enumeration

---

The enumerated type representing the permitted values for the asset property "HardwoodApplication" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HardwoodApplicationType
```
```vb
Public Enumeration HardwoodApplicationType
```
```cpp
public enum class HardwoodApplicationType
```
```fsharp
type HardwoodApplicationType
```

| Member name | Value | Description |
| --- | --- | --- |
| looring | 0 |  |
| urniture | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace